In [38]:
import numpy as np
import pandas as pd

In [58]:
# Magic 명령어
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample1.csv

In [59]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [60]:
# Magic 명령어
%%writefile sample2.csv
1, 1,11, ONE
2, 2.22, TWO
3, 3.33, THREE

Overwriting sample2.csv

In [61]:
pd.read_csv('sample2.csv', header=None)

   0     1       2     3
0  1  1.00      11   ONE
1  2  2.22     TWO   NaN
2  3  3.33   THREE   NaN

In [62]:
pd.read_csv('sample2.csv', names=['c1','c2','c3'])

     c1      c2    c3
1  1.00      11   ONE
2  2.22     TWO   NaN
3  3.33   THREE   NaN

In [63]:
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [64]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Overwriting sample3.txt

In [67]:
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [66]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [49]:
pd.read_csv('sample4.txt', skiprows=[0,1])    # skiprows 열제외

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [51]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing sample5.csv

In [55]:
pd.read_csv('sample5.csv', na_values=['누락'])

    c1     c2      c3
0  1.0   1.11     one
1  2.0            two
2  NaN   3.33   three

In [68]:
df = pd.read_csv('sample5.csv', na_values=['누락', ' '])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

## CSV 파일 출력

In [69]:
df.to_csv('sample6.csv')

In [70]:
!cat sample6.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,, two
2,,3.33, three

In [73]:
pd.read_csv('sample6.csv')

   Unnamed: 0   c1    c2      c3
0           0  1.0  1.11     one
1           1  2.0   NaN     two
2           2  NaN  3.33   three

In [71]:
df.to_csv('sample7.csv', sep='|', index=False)    #index=False 는 인덱스 제거

In [72]:
!cat sample7.csv

c1| c2| c3
1.0|1.11| one
2.0|| two
|3.33| three

In [75]:
pd.read_csv('sample7.csv', sep='|')

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

## 인터넷 상의 CSV 파일 읽기

In [76]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [78]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]